travel.org
* David Zureick-Brown's schedule of upcoming talks & events
#+OPTIONS: toc:nil        (no TOC at all)
#+options: num:nil
#+OPTIONS:   H:2 

   - 2024
     - (March 2-6) [[https://swc-math.github.io/][Arizona Winter School]] on Abelian Varieties (Tucson, AZ)     
     - (January 3-6) [[http://jointmathematicsmeetings.org/jmm][Joint Mathematics Meetings]], (San Francisco, CA)
       - (Jan 4) AMS Special Session on [[https://www.jointmathematicsmeetings.org/meetings/national/jmm2024/2300_program_ss104.html#title][Explicit Computation with Stacks]] (a Mathematics Research Communities session) 
       - (Jan 5-6) Speaking at AMS Special Session on [[https://meetings.ams.org/math/jmm2024/meetingapp.cgi/Session/7756][Arithmetic geometry with a view toward computation]]
   - 2023
     - (Sept 30-Oct 1) [[https://archimede.mat.ulaval.ca/QUEBEC-MAINE/][Maine-Quebec Number Theory Conference]] (University of Maine, Orono, MN)

