travel.org
** Past conferences & talks
   - 2023
     - (June 4-10) [[http://www.ams.org/programs/research-communities/mrc][AMS Mathematical Research Communities]]: Explicit Computations with Stacks  (Java Center, NY)
     - (Apr 17 - Apr 21) [[https://www.msri.org/workshops/1040][Degeneracy of algebraic points]]
     - (March 4-8) Arizona Winter School on Unlikely Intersections (Tucson, AZ)     
     - (Feb 6 - Feb 10)  [[https://www.msri.org/workshops/977][Introductory Workshop: Diophantine Geometry]]
     - (Jan 11-12) [[https://www.simonsfoundation.org/event/simons-collaboration-on-arithmetic-geometry-number-theory-and-computation-annual-meeting-2022/][Simons Collaboration on Arithmetic Geometry, Number Theory, and Computation Annual Meeting]] (NY, NY)      
     - (January 4-7) [[http://jointmathematicsmeetings.org/jmm][Joint Mathematics Meetings]], Speaking at special session on "Arithmetic Statistics" (Boston, MA)

   - 2022
     - (August 28-September 3) [[https://www.simonsfoundation.org/event/geometry-of-arithmetic-statistics-2022/][Simons Symposium on Arithmetic Statistics]] (Krun, Germany) 
     - (April 30-May 1)  [[https://www.daniellitt.com/adding][Anabelian Days Down In Georgia (ADDING)]]
     - (April 1-3) [[http://www.math.emory.edu/~dzb/conferences/GAGS2022/][Georgia Algebraic Geometry Symposium]] @ Emory (Atlanta, GA)
     - (Jan 13-14, cancelled) [[https://www.simonsfoundation.org/event/simons-collaboration-on-arithmetic-geometry-number-theory-and-computation-annual-meeting-2022/][Simons Collaboration on Arithmetic Geometry, Number Theory, and Computation Annual Meeting]] (NY, NY)      
     - (March 5-9) Arizona Winter School (Tucson, AZ)
   - 2021
     - (June 14-18) [[https://sites.google.com/berkeley.edu/rtgworkshop2021/home][RTG workshop]] (Berkeley, CA; Online)
     - (May 10-12) [[https://www.pitt.edu/~caw203/DioGal2021.html][Rational Points and Galois Representations]] (Pittsburgh, PA; Online)
     - (March 25) Colloquium talk at The Ohio State University (Columbus, Ohio)
     - (Feb 8, online) Speaking at the Stanford Number Theory Seminar (Palo Alto, CA)
   - 2020 
     - (December, Virtual) Organizing the [[https://people.math.sc.edu/thornef/pajamas.html][PAlmetto Joint Arithmetic, Modularity, and Analysis Series]], 2
     - (Sept 26) [[https://sites.google.com/wisc.edu/madisonmoduliweekend/home][Speaking at Moduli Conference]] (Madison, WI)
     - (September 8-9, Virtual) Organizing the [[https://people.math.sc.edu/thornef/pajamas.html][PAlmetto Joint Arithmetic, Modularity, and Analysis Series]]
     - (June 20, Virtual) Speaking at [[https://sites.google.com/uic.edu/chicago-number-theory-day/home][Chicago Number Theory Day]] (Chicago, IL)
     - (June 1-5, Virtual) ICERM [[https://icerm.brown.edu/events/sc-20-agntc/][workshop on Arithmetic Geometry, Number Theory, and Computation]] (leading a project group) (Providence, RI)
     - (April 17-19 POSTPONED) [[http://www.math.emory.edu/~dzb/conferences/GAGS2020/][Georgia Algebraic Geometry Symposium]] @ Emory (Atlanta, GA) 
     - (May 11 CANCELLED) Emory's Commencement  
     - (May 3-9 POSTPONED) [[https://www.simonsfoundation.org/event/geometry-of-arithmetic-statistics-2020/][Simons Symposium on Arithmetic Statistics]] (Krun, Germany) 
     - (Apr 9 POSTPONED) [[https://research.franklin.uga.edu/agant/joint-athens-atlanta-number-theory-seminar][Athens-Atlanta Joint Number Theory Seminar]] @Emory
     - (Apr 3-5 POSTPONED) Speaking @ South Eastern Regional Meeting On Numbers ([[https://services.math.duke.edu/~pierce/DukeNumberTheoryApril2020.shtml][SERMON]])
     - (Mar 7-11) [[http://swc.math.arizona.edu/][Arizona Winter School]] on Non-abelian Chabauty (Tucson, AZ)
     - (Mar 3) Speaking at [[https://sites.google.com/view/vantageseminar][VaNTAGe]].
   - 2019
     - (Nov 1-3) [[https://sites.google.com/view/maaim/home][MAAIM]] (Modular Forms, Arithmetic, and Women in Mathematics),
     - (Aug 28) Speaking at the Berkeley Number Theory Seminar (Berkeley, CA)      
     - (July 14-20) [[http://www.mathe2.uni-bayreuth.de/stoll/workshop2017/index.html][Rational Points 2019]] (Germany)
     - (June 4) Seminar talk at Universite Blaise Pascal Clermont-Ferrand 2 (Aubiere, France) 
     - (May-July) [[https://www-fourier.ujf-grenoble.fr/ratio2019/conferences.php?lang%3Duk][Reinventing rational points]] (trimester program at Institut Henri Poincare, Paris, France), including:
       - (May 20-24) [[http://www.ihp.fr/en/CEB/T2-2019/Workshop1][Rational points on Fano and similar varieties]]
       - (June 24-28) Speaking at: [[http://www.ihp.fr/en/CEB/T2-2019/Workshop2][Rational points on irrational varieties]]
       - See also [[http://www.ihp.fr/en/CEB/T2-2019][this]] link
     - (May 6-10) Number Theory Seminar talk at University of Wisconsin, Madison (Madison, WI)
     - (Mar 30-31) [[https://math.gatech.edu/events/georgia-tech-tropical-arithmetic-and-combinatorial-algebraic-geometry][GATTACA]] at Georgia Tech (Atlanta, GA) 
     - (Mar 22-24) Speaking at AMS Special Session on ``[[http://www.ams.org/meetings/sectional/2251_program_ss36.html#title][Algebraic Points]]''  (Honolulu, HI)
     - (Mar 2-6) Arizona Winter School
     - (Feb 21) Colloquium talk at the University of Miami (Miami, FL)
     - (Feb 6) Seminar talk at the University of Georgia (Athens, GA)
     - (16-19 Jan) [[http://jointmathematicsmeetings.org/jmm][Joint Mathematics Meetings]] (Baltimore, MD)
       - (18 Jan) Speaking at special session on "[[http://jointmathematicsmeetings.org/meetings/national/jmm2019/2217_program_ss53.html#title][Arithmetic Statistics]]".
       - (19 Jan) Speaking at special session on "[[http://jointmathematicsmeetings.org/meetings/national/jmm2019/2217_program_ss61.html][Number Theory, Arithmetic Geometry, and Computation]]".
     - (10-11 Jan) [[https://www.simonsfoundation.org/event/simons-collaboration-on-arithmetic-geometry-number-theory-and-computation-annual-meeting-2018/][Simons Collaboration on Arithmetic Geometry, Number Theory, and Computation Annual Meeting]] (NY, NY)      
   - 2018
     - (8-9 Dec)    [[http://people.math.sc.edu/boylan/seminars/pantshome.html][PANTS]] XXXI (Columbia, SC)    
     - (19 Nov) Seminar talk at Northwestern University (Evanston, IL)
     - (28-31 Oct)  Visiting Melanie Matchett Wood (Princeton, NJ)
     - (7-12 Oct)   Visiting MIT (Boston, MA)
     - (13-16 Sept) [[http://people.math.sc.edu/boylan/seminars/pantshome.html][PANTS]] XXX (Wake Forest, NC)
     - (14 Sept) Colloquium at Wake Forest University (Winston-Salem, NC ) 
     - (22-28 July) [[https://www.mfo.de/occasion/1830/www_view][Explicit Methods in Number Theory]] (Oberwolfach, Germany)
     - (9-13  July) [[https://conf.lmno.cnrs.fr/berkovich30years/][Berkovich spaces, 30 years]] (Paris, France)
     - (2-6   July) [[http://pub.math.leidenuniv.nl/~brightmj/rp/][Rational Points on Schiermonnikoog]]  (Schiermonnikoog, Netherlands).
     - (25-29 June) [[https://web.math.pmf.unizg.hr/~fnajman/Torsion_Gal_rep.html][Torsion and Galois representations of elliptic curves]]         (Zabreb, Croatia).
     - (4-8 June) Barry [[http://www.math.harvard.edu/conferences/mazur18/index.html][Mazur's 80th birthday conference]] (Boston, MA)
     - (27 May - 1 June) BIRS Workshop on "[[http://www.birs.ca/events/2018/5-day-workshops/18w5012][Rational and Integral Points via Analytic and Geometric Methods]]"  (Oaxaca, Mexico)
     - (5-7 April) Speaking at the University of Arkansas 43rd annual Spring Lecture Series, 
       "[[https://fulbright.uark.edu/departments/math/research/spring-lecture-series/index.php][Old and New Themes in p-adic cohomology]]" (Fayetteville, AR)
     - (Mar 29) Seminar Talk  at Johns Hopkins University  (Baltimore, MD)
     - (Mar 12-16) Emory's spring break
     - (Mar 3-7) [[http://swc.math.arizona.edu/index.html][Arizona Winter School]] on Iwasawa theory (Tucson, AZ)
     - (20 Feb) [[http://alpha.math.uga.edu/~lorenz/JointAthensAtlantaSeminar.html][Athens-Atlanta Joint Number Theory Seminar]] @UGA
     - (Feb 13) Seminar Talk  at Colorado State University (Ft. Collins, CO)
     - (Feb 12) Colloquium at Colorado State University  (Ft. Collins, CO)
     - (Jan 30) Seminar Talk  at Rice University (Houston, TX)
     - (10-13 Jan) [[http://jointmathematicsmeetings.org/jmm][Joint Mathematics Meetings]] in San Diego, (San Diego, CA)
       - Speaking at special session on "Accessible Problems in Modern Number Theory".
   - 2017
     - (17 Nov) Colloquium at Portland State (Portland, OR)    
     - (21 Oct) Speaking at the [[https://www.math.uci.edu/~krubin/scntd/][Fall 2017 Southern California Number Theory Day]] (Irvine, CA)
     - (1-6 Oct) BIRS Workshop on "[[http://www.birs.ca/events/2017/5-day-workshops/17w5118][p-adic Cohomology and Arithmetic Applications]]"  (Alberta, Canada)
     - (29 Sept - 1 Oct) BIRS Workshop on "[[http://www.birs.ca/events/2017/2-day-workshops/17w2677][Open Source Computation and Algebraic Surfaces]]"  (Alberta, Canada)
     - (7 Sept) Seminar talk at University of Wisconsin, Madison (Madison, Wi)
     - (29 Aug) Seminar talk at University of Arizona (Tucson, AZ)
     - (25 Sept) Speaking at the Stanford Number Theory Seminar (Palo Alto, CA)
     - (Fall 2017) Sabbatical! Mostly in Madison, WI.
     - (June - July) [[http://mathcs.emory.edu/~ono/REUs/][Emory's REU]], (Atlanta, GA)
     - (28 May - 2 June) BIRS Workshop on "[[http://www.birs.ca/events/2017/5-day-workshops/17w5065][Arithmetic Aspects of Explicit Moduli Problems]]"  (Alberta, Canada)
     - (22-26 May) Emory Summer Research Institute in Arithmetic Geometry (Atlanta, GA)
     - (15-19 May) [[https://sites.google.com/site/echorap2017/][ECHORaP]] (Emory Conference on Higher Obstructions to Rational Points) (Atlanta, GA)
     - (31 Mar - 2 Apr) South Eastern Regional Meeting On Numbers XXX ([[http://www.unf.edu/~mdedeo/sermon.htm][SERMON]])
     - (23 Mar) Colloquium at Reed (Portland, OR)
     - (22 Mar) Seminar talk at the University of Rochester (Rochester, NY)
     - (11-16 Mar) [[http://swc.math.arizona.edu/][Arizona Winter School]] on "Perfectoid Spaces" (Tucson, AZ)
     - (3-5 Mar) [[https://sites.google.com/site/galgeoms2017/][Georgia Algebraic Geometry Symposium]] @ UGA (Athens, GA) 
     - (24 Feb) Colloquium at Tufts University (Boston, MA)
     - (17-19 Feb) Speaking at "[[http://math.rice.edu/NewsEvents/Conferences/RTG2017/index.html][Lectures in Arithmetic Geometry at Rice]]", (Houston TX)
     - (24 Jan) Speaking at the Berkeley Number Theory Seminar (Berkeley, CA)
     - (4-7 January) [[http://www.ams.org/meetings/national/national#sthash.jaxPeF2E.dpuf][Joint Mathematics Meetings]] in Atlanta, (Atlanta, GA)
       - Speaking at special session on "[[https://jointmathematicsmeetings.org/meetings/national/jmm2017/2180_program_ss33.html][Minimal integral models of algebraic curves]]".
   - 2016
     - (Dec 3-4) [[http://www.math.clemson.edu/~kevja/PANTS/PANTS25/][PANTS]] XXVII [not attending] (Columbia, SC).
     - (16 Nov) Seminar talk at the University of Miami (Miami, FL)
     - (26-28 Oct) NSF Panel (Arlington, VA)
     - (19 Oct) Seminar talk at the University of Kentucky (Lexington, KY)
     - (18 Oct) Athens-Atlanta Joint Number Theory Seminar @UGA
     - (Sept 17-18) [update: not attending] [[https://www.uncg.edu/mat/numbertheory/conferences/PANTS-XXVI.html][PANTS]] XXVI  (Greensboro, SC).
     - (10-11 Sept) Speaking at "[[http://www.uvm.edu/~tdupuy/anabelian.html][Kummer Classes and Anabelian Geometry]]", (Burlington VT)
     - (Aug 8-12) Visiting UW-Madison (Madison, WI).
     - (June 6- July 15) [[http://mathcs.emory.edu/~ono/REUs/][Emory's REU]], (Atlanta, GA)
     - (1-3 Apr) Speaking at South Eastern Regional Meeting On Numbers XXIX ([[http://educ.jmu.edu/~webbjj/sermon.html][SERMON]])
     - (14-16 Jan) Attending [[https://www.math.gatech.edu/hodge2016][A Workshop on the Proof of Rota's Conjecture]] at Georgia (Atlanta, GA)
     - (5-6 Mar) Speaking at AMS Special Session on ``[[http://www.ams.org/meetings/sectional/2237_program_ss1.html#title][Elliptic Curves]]''  (Athens, GA)
     - (11-16 Mar) [[http://swc.math.arizona.edu/][Arizona Winter School]] on "Analytic Methods in Arithmetic Geometry" (Tucson, AZ)
     - (Jan 29) Colloquium and seminar talk at the University of Tennessee (Knoxville, TN)
   - 2015
     - (5-6 Dec) [[http://www.math.clemson.edu/~kevja/PANTS/PANTS25/][PANTS]] XXV (Clemson, SC).
     - (Nov 11-20) Visiting Eric Katz (Waterloo, CA)
     - (Nov 10) Number Theory Seminar talk at the University of Oregon (Eugene, OR)
     - (Nov 9) Colloquium at the University of Oregon (Eugene, OR)
     - (23-25 Oct) [[https://sites.google.com/site/galgeoms2015/][Georgia Algebraic Geometry Symposium]] @ Emory (Atlanta, GA) 
     - (Sept 25) Speaking at the UW-Madison geometry seminar (Madison, WI).       
     - (Sept 17) Speaking at the UW-Madison Number Theory seminar (Madison, WI).
     - (Sept 12-13) [[http://www.mathcs.emory.edu/pantsxxiv/][PANTS]] @ Emory (Atlanta, GA).
     - (Sept) Visiting UW-Madison (Madison, WI).
     - (Aug 17-21) [[http://aimath.org/workshops/upcoming/degenalggeom/][AIM workshop]] on Degenerations in Algebraic  Geometry (Palo Alto, CA) 
     - (12-31 July) [[http://www2.imperial.ac.uk/~rpwt/AMS.html][AMS Algebraic Geometry Summer Research Institute]] (University of Utah)
     - (June 8- July 17) [[http://mathcs.emory.edu/~ono/REUs/][Emory's REU]] (Atlanta, GA)
     - (26-30 May) Speaking at the [[https://sites.google.com/site/padicmethods2015/][Coleman Memorial Conference]] at MSRI (Berkeley, CA)
     - (17-22 May) Visiting Chris Hall at the IAS (Princeton, NJ)
     - (7-13 May) Speaking at the University of Copenhagen (Copenhagen, Denmark)
     - (30 Apr - 3 May) Speaking at the Cornell Number Theory Seminar (Ithaca, NY)
     - (28 Apr) Speaking at the UIC Number Theory Seminar (Chicago, IL)
     - (13 Apr) Speaking at the Stanford Number Theory Seminar (Palo Alto, CA)
     - (9 Apr) Athens-Atlanta Joint Number Theory Seminar @UGA (Atlanta, GA)
     - (2-4 Apr) Speaking at the Duke Number Theory Seminar (Durham, NC)
     - (28-29 Mar) Speaking at [[http://www.ces.clemson.edu/~jimlb/SERMON/2015/SERMON_2015_participants.html][SERMON]] at Winthrop University (Rock Hill, SC)
     - (23 Mar) Math club talk at Georgia State (Atlanta, GA)
     - (13-18 Mar) [[http://swc.math.arizona.edu/][Arizona Winter School]] on Arithmetic and Higher-Dimensional Varieties (Tucson, AZ)
     - (10 Mar) Colloquium at the University of Colorado-Boulder (Boulder, CO)
     - (20 Feb) Colloquium at the University of Wisconsin-Madison (Madison, WI)       
   - 2014
     - (6-7 Dec) [[http://www.math.sc.edu/~boylan/seminars/pantshome.html][PANTS]] (Columbia, SC).
     - (26-28 Nov) Thanksgiving break.
     - (8-9 Nov) AMS Special Sessions on ``[[http://e-math.ams.org/meetings/sectional/2222_program_saturday.html][Automorphic forms and related topics]]'' and [[http://e-math.ams.org/meetings/sectional/2222_program_ss20.html#title]["Connections in Number Theory]]" (Greensboro, NC)
     - (4 Nov) Athens-Atlanta Joint Number Theory Seminar @GaTech (Atlanta, GA)
     - (25-26 Oct) AMS Special Session on ``[[http://www.ams.org/meetings/sectional/2214_program_ss9.html#title][Combinatorics and Algebraic Geometry]]'' (San Francisco, CA)
     - (18-19 Oct) [[http://gags.torsor.org/conf2014/][Georgia Algebraic Geometry Symposium]] at UGA (Athens, GA) 
     - (13-14 Oct) Fall break.
     - (26 Sept) Speak at UVA  (Charlottesville, VA)
     - (6-7 Sept) [[http://www.math.sc.edu/~boylan/seminars/pantshome.html][PANTS]] (Orangeburg, SC).
     - (9 June - 18 July) Emory's REU (Atlanta, GA)
     - (12-16 May) [[http://www.aimath.org/ARCC/workshops/ratlhigherdimvar.html][AIM workshop]] on Rational Points  (Palo Alto, CA) 
     - (5-6 April) AMS special session on "[[http://www.ams.org/meetings/sectional/2215_program_ss17.html#title][Arithmetic and Differential Algebraic Geometry]]" (Albuquerque, NM)
     - (30 March - 4 April) BIRS Workshop on "[[http://www.birs.ca/events/2014/5-day-workshops/14w5133][Specialization of Linear Series for Algebraic and Tropical Curves]]"  (Alberta, Canada)
     - (21-23 March) AMS special session on "[[http://www.ams.org/meetings/sectional/2216_program_ss9.html#title][Arithmetic of Algebraic Curves]]" (Knoxville, TN)
     - (15-19 March) [[http://swc.math.arizona.edu/][Arizona Winter School]] on Arithmetic Statistics (Tucson, Arizona)
     - (28 Feb) Speak at USC  (Columbia, SC)
     - (25 Feb) Athens-Atlanta Joint Number Theory Seminar @Emory (Atlanta, GA)
     - (27-31 January) [[http://aimath.org/ARCC/workshops/arithstatffield.html][AIM workshop]] on Arithmetic Statistics (Palo Alto, CA)
     - (15-18 January) Joint Mathematics Meetings in Baltimore, Speaking at the special session on "[[http://jointmathematicsmeetings.org/meetings/national/jmm2014/2160_program_ss56.html][Tropical and Nonarchimedean Geometry]]" (Baltimore, MD)
   - 2013
     - (28-29 Nov) Thanksgiving break.
     - (7-8 Dec) [[http://www.math.sc.edu/~boylan/seminars/pantshome.html][PANTS]] (Clemson, SC).
     - (8-10 Nov) [[http://www.math.sc.edu/~kustin/CA-AGMeeting.html][Commutative Algebra -- Algebraic Geometry in the Southeast]] (USC, SC)
     - (5 Nov) [[http://www.math.uga.edu/~lorenz/JointAthensAtlantaSeminar.html][Athens-Atlanta Joint Number Theory Seminar]] at UGA (Athens, GA)
     - (18-20 Oct) [[http://gags.torsor.org/conf2013/][Georgia Algebraic Geometry Symposium]] at UGA (Athens, GA) 
     - (14-15 Oct) Fall Break.
     - (9-16 Oct) Speaking at the Copenhagen Number Theory Seminar (Copenhagen, Denmark)
     - (11 Sep) Speaking at the Clemson Number Theory Seminar  (Clemson, SC).
     - (7-8 Sep) [[http://www.math.sc.edu/~boylan/seminars/pantshome.html][PANTS]] (Davidson, NC).
     - (1-4 August) [[http://wiki.siam.org/siag-ag/index.php/SIAM_Conference_on_Applied_Algebraic_Geometry_2013][SIAM Conference on Applied Algebraic Geometry]] at Colorado State University (Fort Collins, CO).
     - (3 June - 26 July) REU (Atlanta, GA)
     - (20-24 May) Colloquium at Wake Forest University (Winston-Salem, NC )
     - (3-5 May) [[http://homepages.math.uic.edu/~rtakloo/atkin2013.html][Atkin Memorial Lectures and workshop on the Cohen-Lenstra conjectures]] at University of Chicago (Chicago, IL)
     - (22-27 April) Colloquium and Number Theory Seminar at the University of
       Arizona (Tucson, AZ)
     - (16 April) Athens-Atlanta Joint Number Theory Seminar (Atlanta, GA)
     - (13-14 April) AMS special session on "Arithmetic statistics
       and big monodromy" (Denver, CO).
     - (9-13 March) [[http://swc.math.arizona.edu/aws/2013/index.html][Arizona Winter School]] on Modular forms and Modular curves (Tucson, Arizona)
     - (Jan 30-Feb 2) [[http://scienceonline.com/][Scienceonline 2013]], speaking about MathOverflow (Raleigh, NC)
     - (Jan 9-12) Joint Mathematics Meetings;
       Speaking at the special sessions on "Witt Vectors" and "Geometry and Number Theory" (San Diego, CA)
   - 2012
     - (1-2 Dec) PANTS XIX (USC, SC).
     - (8-18 Nov) [[http://rational.epfl.ch/workshop2.php][Workshop: Arithmetic of abelian varieties in families]], EPFL, (Lausanne, Switzerland)
     - (17 Sep) Speaking at Ga Tech @ 3p (Atlanta, GA)
     - (15-16 Sep) Speaking at [[http://www.wfu.edu/~rouseja/pantsxviii/][PANTS XVIII]] (Wake Forest, NC).
     - (21 Aug) Speaking at the Colorado State Number Theory Seminar (Ft. Collins, Colorado)
     - (11 June -- 27 July) REU (Emory University, GA) 
     - (May) Visiting Bruno Chiarellotto (Padova, Italy)
     - (10 Apr) Athens-Atlanta Joint Number Theory Seminar (Athens, GA)
     - (4-9 Apr) Speaking at the UC Irvine Number Theory Seminar on 4/5 (Irvine, CA)
     - (20 March) Visitor @ Emory: Anton Geraschenko
     - (10-13 Mar) Arizona Winter School (Tucson, AZ)
     - (2-9 Mar) AMS Sectional + Algebraic Number Theory, Arithmetic Geometry, and Modular Forms (Hawaii)
     - (9 Feb) Speaking at the New York Joint Number Theory Seminar (CUNY)
     - (25 Jan) Speaking at the Number Theory Seminar (UGA)
     - (02 Feb) Visitor @ Emory: Jeremy Rouse
     - (20 Jan) Visitor @ Emory: Frank Thorne
     - (4-7 January) Joint Mathematics Meetings in Boston
       Speaking at the special session on "Rational Points on Varieties" and "Arithmetic Geometry".
   - 2011
     - (3-4 Dec) PANTS XVII (Clemson, SC).
     - (29 Nov - 1 Dec) Speaking at the Harvard Number Theory seminar on Wednesday.
     - (10-16 November) Visiting Caltech, speaking at the Algebraic Geometry seminar on Monday.
     - (2 November) Speaking at the Athens-Atlanta Joint Number Theory Seminar (Georgia Tech).
     - (13 Oct) Speaking at the Emory Algebra and Number Theory Seminar.
     - (10-11 Oct) Speaking at the University of South Carolina Number Theory Seminar on Tuesday.
     - (23-25 September) AMS special session on Modular Forms and Elliptic Curves (Wake Forest Univeristy, NC).
     - (10-11 September) Attending PANTS (Emory).
