travel.html
<li>(June 4-10) <a href="http://www.ams.org/programs/research-communities/mrc">AMS Mathematical Research Communities</a>: Explicit Computations with Stacks  (Java Center, NY)
</li>
<li>(Apr 17 - Apr 21) <a href="https://www.msri.org/workshops/1040">Degeneracy of algebraic points</a>
</li>
<li>(March 4-8) Arizona Winter School on Unlikely Intersections (Tucson, AZ)     
</li>
<li>(Feb 6 - Feb 10)  <a href="https://www.msri.org/workshops/977">Introductory Workshop: Diophantine Geometry</a>
</li>
<li>(Jan 31) Colloquium talk at the University of Toronto (Toronto, CA)
</li>
<li>(Jan 26) Colloquium talk at Amherst College (Amherst, MA)
</li>
<li>(Jan 11-12) <a href="https://www.simonsfoundation.org/event/simons-collaboration-on-arithmetic-geometry-number-theory-and-computation-annual-meeting-2022/">Simons Collaboration on Arithmetic Geometry, Number Theory, and Computation Annual Meeting</a> (NY, NY)      
</li>
<li>(January 4-7) <a href="http://jointmathematicsmeetings.org/jmm">Joint Mathematics Meetings</a>, Speaking at special session on "Arithmetic Statistics" (Boston, MA)
</li>
</ul>
</li>

<li>2022
<ul class="org-ul">
<li>(August 28-September 3) <a href="https://www.simonsfoundation.org/event/geometry-of-arithmetic-statistics-2022/">Simons Symposium on Arithmetic Statistics</a> (Krun, Germany) 
</li>
<li>(April 30-May 1)  <a href="https://www.daniellitt.com/adding">Anabelian Days Down In Georgia (ADDING)</a>
</li>
<li>(April 1-3) <a href="http://www.math.emory.edu/~dzb/conferences/GAGS2022/">Georgia Algebraic Geometry Symposium</a> @ Emory (Atlanta, GA)
</li>
<li>(Jan 13-14, cancelled) <a href="https://www.simonsfoundation.org/event/simons-collaboration-on-arithmetic-geometry-number-theory-and-computation-annual-meeting-2022/">Simons Collaboration on Arithmetic Geometry, Number Theory, and Computation Annual Meeting</a> (NY, NY)      
</li>
<li>(March 5-9) Arizona Winter School (Tucson, AZ)
</li>
</ul>
</li>
<li>2021
<ul class="org-ul">
<li>(June 14-18) <a href="https://sites.google.com/berkeley.edu/rtgworkshop2021/home">RTG workshop</a> (Berkeley, CA; Online)
</li>
<li>(May 10-12) <a href="https://www.pitt.edu/~caw203/DioGal2021.html">Rational Points and Galois Representations</a> (Pittsburgh, PA; Online)
</li>
<li>(March 25) Colloquium talk at The Ohio State University (Columbus, Ohio)
</li>
<li>(Feb 8, online) Speaking at the Stanford Number Theory Seminar (Palo Alto, CA)
</li>
</ul>
</li>
<li>2020 
<ul class="org-ul">
<li>(December, Virtual) Organizing the <a href="https://people.math.sc.edu/thornef/pajamas.html">PAlmetto Joint Arithmetic, Modularity, and Analysis Series</a>, 2
</li>
<li>(Sept 26) <a href="https://sites.google.com/wisc.edu/madisonmoduliweekend/home">Speaking at Moduli Conference</a> (Madison, WI)
</li>
<li>(September 8-9, Virtual) Organizing the <a href="https://people.math.sc.edu/thornef/pajamas.html">PAlmetto Joint Arithmetic, Modularity, and Analysis Series</a>
</li>
<li>(June 20, Virtual) Speaking at <a href="https://sites.google.com/uic.edu/chicago-number-theory-day/home">Chicago Number Theory Day</a> (Chicago, IL)
</li>
<li>(June 1-5, Virtual) ICERM <a href="https://icerm.brown.edu/events/sc-20-agntc/">workshop on Arithmetic Geometry, Number Theory, and Computation</a> (leading a project group) (Providence, RI)
</li>
<li>(April 17-19 POSTPONED) <a href="http://www.math.emory.edu/~dzb/conferences/GAGS2020/">Georgia Algebraic Geometry Symposium</a> @ Emory (Atlanta, GA) 
</li>
<li>(May 11 CANCELLED) Emory's Commencement  
</li>
<li>(May 3-9 POSTPONED) <a href="https://www.simonsfoundation.org/event/geometry-of-arithmetic-statistics-2020/">Simons Symposium on Arithmetic Statistics</a> (Krun, Germany) 
</li>
<li>(Apr 9 POSTPONED) <a href="https://research.franklin.uga.edu/agant/joint-athens-atlanta-number-theory-seminar">Athens-Atlanta Joint Number Theory Seminar</a> @Emory
</li>
<li>(Apr 3-5 POSTPONED) Speaking @ South Eastern Regional Meeting On Numbers (<a href="https://services.math.duke.edu/~pierce/DukeNumberTheoryApril2020.shtml">SERMON</a>)
</li>
<li>(Mar 7-11) <a href="http://swc.math.arizona.edu/">Arizona Winter School</a> on Non-abelian Chabauty (Tucson, AZ)
</li>
<li>(Mar 3) Speaking at <a href="https://sites.google.com/view/vantageseminar">VaNTAGe</a>.
</li>
</ul>
</li>
<li>2019
<ul class="org-ul">
<li>(Nov 1-3) <a href="https://sites.google.com/view/maaim/home">MAAIM</a> (Modular Forms, Arithmetic, and Women in Mathematics),
</li>
<li>(Aug 28) Speaking at the Berkeley Number Theory Seminar (Berkeley, CA)      
</li>
<li>(July 14-20) <a href="http://www.mathe2.uni-bayreuth.de/stoll/workshop2017/index.html">Rational Points 2019</a> (Germany)
</li>
<li>(June 4) Seminar talk at Universite Blaise Pascal Clermont-Ferrand 2 (Aubiere, France) 
</li>
<li>(May-July) <a href="https://www-fourier.ujf-grenoble.fr/ratio2019/conferences.php?lang=uk">Reinventing rational points</a> (trimester program at Institut Henri Poincare, Paris, France), including:
<ul class="org-ul">
<li>(May 20-24) <a href="http://www.ihp.fr/en/CEB/T2-2019/Workshop1">Rational points on Fano and similar varieties</a>
</li>
<li>(June 24-28) Speaking at: <a href="http://www.ihp.fr/en/CEB/T2-2019/Workshop2">Rational points on irrational varieties</a>
</li>
<li>See also <a href="http://www.ihp.fr/en/CEB/T2-2019">this</a> link
</li>
</ul>
</li>
<li>(May 6-10) Number Theory Seminar talk at University of Wisconsin, Madison (Madison, WI)
</li>
<li>(Mar 30-31) <a href="https://math.gatech.edu/events/georgia-tech-tropical-arithmetic-and-combinatorial-algebraic-geometry">GATTACA</a> at Georgia Tech (Atlanta, GA) 
</li>
<li>(Mar 22-24) Speaking at AMS Special Session on ``<a href="http://www.ams.org/meetings/sectional/2251_program_ss36.html#title">Algebraic Points</a>''  (Honolulu, HI)
</li>
<li>(Mar 2-6) Arizona Winter School
</li>
<li>(Feb 21) Colloquium talk at the University of Miami (Miami, FL)
</li>
<li>(Feb 6) Seminar talk at the University of Georgia (Athens, GA)
</li>
<li>(16-19 Jan) <a href="http://jointmathematicsmeetings.org/jmm">Joint Mathematics Meetings</a> (Baltimore, MD)
<ul class="org-ul">
<li>(18 Jan) Speaking at special session on "<a href="http://jointmathematicsmeetings.org/meetings/national/jmm2019/2217_program_ss53.html#title">Arithmetic Statistics</a>".
</li>
<li>(19 Jan) Speaking at special session on "<a href="http://jointmathematicsmeetings.org/meetings/national/jmm2019/2217_program_ss61.html">Number Theory, Arithmetic Geometry, and Computation</a>".
</li>
</ul>
</li>
<li>(10-11 Jan) <a href="https://www.simonsfoundation.org/event/simons-collaboration-on-arithmetic-geometry-number-theory-and-computation-annual-meeting-2018/">Simons Collaboration on Arithmetic Geometry, Number Theory, and Computation Annual Meeting</a> (NY, NY)      
</li>
</ul>
</li>
<li>2018
<ul class="org-ul">
<li>(8-9 Dec)    <a href="http://people.math.sc.edu/boylan/seminars/pantshome.html">PANTS</a> XXXI (Columbia, SC)    
</li>
<li>(19 Nov) Seminar talk at Northwestern University (Evanston, IL)
</li>
<li>(28-31 Oct)  Visiting Melanie Matchett Wood (Princeton, NJ)
</li>
<li>(7-12 Oct)   Visiting MIT (Boston, MA)
</li>
<li>(13-16 Sept) <a href="http://people.math.sc.edu/boylan/seminars/pantshome.html">PANTS</a> XXX (Wake Forest, NC)
</li>
<li>(14 Sept) Colloquium at Wake Forest University (Winston-Salem, NC ) 
</li>
<li>(22-28 July) <a href="https://www.mfo.de/occasion/1830/www_view">Explicit Methods in Number Theory</a> (Oberwolfach, Germany)
</li>
<li>(9-13  July) <a href="https://conf.lmno.cnrs.fr/berkovich30years/">Berkovich spaces, 30 years</a> (Paris, France)
</li>
<li>(2-6   July) <a href="http://pub.math.leidenuniv.nl/~brightmj/rp/">Rational Points on Schiermonnikoog</a>  (Schiermonnikoog, Netherlands).
</li>
<li>(25-29 June) <a href="https://web.math.pmf.unizg.hr/~fnajman/Torsion_Gal_rep.html">Torsion and Galois representations of elliptic curves</a>         (Zabreb, Croatia).
</li>
<li>(4-8 June) Barry <a href="http://www.math.harvard.edu/conferences/mazur18/index.html">Mazur's 80th birthday conference</a> (Boston, MA)
</li>
<li>(27 May - 1 June) BIRS Workshop on "<a href="http://www.birs.ca/events/2018/5-day-workshops/18w5012">Rational and Integral Points via Analytic and Geometric Methods</a>"  (Oaxaca, Mexico)
</li>
<li>(5-7 April) Speaking at the University of Arkansas 43rd annual Spring Lecture Series, 
"<a href="https://fulbright.uark.edu/departments/math/research/spring-lecture-series/index.php">Old and New Themes in p-adic cohomology</a>" (Fayetteville, AR)
</li>
<li>(Mar 29) Seminar Talk  at Johns Hopkins University  (Baltimore, MD)
</li>
<li>(Mar 12-16) Emory's spring break
</li>
<li>(Mar 3-7) <a href="http://swc.math.arizona.edu/index.html">Arizona Winter School</a> on Iwasawa theory (Tucson, AZ)
</li>
<li>(20 Feb) <a href="http://alpha.math.uga.edu/~lorenz/JointAthensAtlantaSeminar.html">Athens-Atlanta Joint Number Theory Seminar</a> @UGA
</li>
<li>(Feb 13) Seminar Talk  at Colorado State University (Ft. Collins, CO)
</li>
<li>(Feb 12) Colloquium at Colorado State University  (Ft. Collins, CO)
</li>
<li>(Jan 30) Seminar Talk  at Rice University (Houston, TX)
</li>
<li>(10-13 Jan) <a href="http://jointmathematicsmeetings.org/jmm">Joint Mathematics Meetings</a> in San Diego, (San Diego, CA)
<ul class="org-ul">
<li>Speaking at special session on "Accessible Problems in Modern Number Theory".
</li>
</ul>
</li>
</ul>
</li>
<li>2017
<ul class="org-ul">
<li>(17 Nov) Colloquium at Portland State (Portland, OR)    
</li>
<li>(21 Oct) Speaking at the <a href="https://www.math.uci.edu/~krubin/scntd/">Fall 2017 Southern California Number Theory Day</a> (Irvine, CA)
</li>
<li>(1-6 Oct) BIRS Workshop on "<a href="http://www.birs.ca/events/2017/5-day-workshops/17w5118">p-adic Cohomology and Arithmetic Applications</a>"  (Alberta, Canada)
</li>
<li>(29 Sept - 1 Oct) BIRS Workshop on "<a href="http://www.birs.ca/events/2017/2-day-workshops/17w2677">Open Source Computation and Algebraic Surfaces</a>"  (Alberta, Canada)
</li>
<li>(7 Sept) Seminar talk at University of Wisconsin, Madison (Madison, Wi)
</li>
<li>(29 Aug) Seminar talk at University of Arizona (Tucson, AZ)
</li>
<li>(25 Sept) Speaking at the Stanford Number Theory Seminar (Palo Alto, CA)
</li>
<li>(Fall 2017) Sabbatical! Mostly in Madison, WI.
</li>
<li>(June - July) <a href="http://mathcs.emory.edu/~ono/REUs/">Emory's REU</a>, (Atlanta, GA)
</li>
<li>(28 May - 2 June) BIRS Workshop on "<a href="http://www.birs.ca/events/2017/5-day-workshops/17w5065">Arithmetic Aspects of Explicit Moduli Problems</a>"  (Alberta, Canada)
</li>
<li>(22-26 May) Emory Summer Research Institute in Arithmetic Geometry (Atlanta, GA)
</li>
<li>(15-19 May) <a href="https://sites.google.com/site/echorap2017/">ECHORaP</a> (Emory Conference on Higher Obstructions to Rational Points) (Atlanta, GA)
</li>
<li>(31 Mar - 2 Apr) South Eastern Regional Meeting On Numbers XXX (<a href="http://www.unf.edu/~mdedeo/sermon.htm">SERMON</a>)
</li>
<li>(23 Mar) Colloquium at Reed (Portland, OR)
</li>
<li>(22 Mar) Seminar talk at the University of Rochester (Rochester, NY)
</li>
<li>(11-16 Mar) <a href="http://swc.math.arizona.edu/">Arizona Winter School</a> on "Perfectoid Spaces" (Tucson, AZ)
</li>
<li>(3-5 Mar) <a href="https://sites.google.com/site/galgeoms2017/">Georgia Algebraic Geometry Symposium</a> @ UGA (Athens, GA) 
</li>
<li>(24 Feb) Colloquium at Tufts University (Boston, MA)
</li>
<li>(17-19 Feb) Speaking at "<a href="http://math.rice.edu/NewsEvents/Conferences/RTG2017/index.html">Lectures in Arithmetic Geometry at Rice</a>", (Houston TX)
</li>
<li>(24 Jan) Speaking at the Berkeley Number Theory Seminar (Berkeley, CA)
</li>
<li>(4-7 January) <a href="http://www.ams.org/meetings/national/national#sthash.jaxPeF2E.dpuf">Joint Mathematics Meetings</a> in Atlanta, (Atlanta, GA)
<ul class="org-ul">
<li>Speaking at special session on "<a href="https://jointmathematicsmeetings.org/meetings/national/jmm2017/2180_program_ss33.html">Minimal integral models of algebraic curves</a>".
</li>
</ul>
</li>
</ul>
</li>
<li>2016
<ul class="org-ul">
<li>(Dec 3-4) <a href="http://www.math.clemson.edu/~kevja/PANTS/PANTS25/">PANTS</a> XXVII [not attending] (Columbia, SC).
</li>
<li>(16 Nov) Seminar talk at the University of Miami (Miami, FL)
</li>
<li>(26-28 Oct) NSF Panel (Arlington, VA)
</li>
<li>(19 Oct) Seminar talk at the University of Kentucky (Lexington, KY)
</li>
<li>(18 Oct) Athens-Atlanta Joint Number Theory Seminar @UGA
</li>
<li>(Sept 17-18) [update: not attending] <a href="https://www.uncg.edu/mat/numbertheory/conferences/PANTS-XXVI.html">PANTS</a> XXVI  (Greensboro, SC).
</li>
<li>(10-11 Sept) Speaking at "<a href="http://www.uvm.edu/~tdupuy/anabelian.html">Kummer Classes and Anabelian Geometry</a>", (Burlington VT)
</li>
<li>(Aug 8-12) Visiting UW-Madison (Madison, WI).
</li>
<li>(June 6- July 15) <a href="http://mathcs.emory.edu/~ono/REUs/">Emory's REU</a>, (Atlanta, GA)
</li>
<li>(1-3 Apr) Speaking at South Eastern Regional Meeting On Numbers XXIX (<a href="http://educ.jmu.edu/~webbjj/sermon.html">SERMON</a>)
</li>
<li>(14-16 Jan) Attending <a href="https://www.math.gatech.edu/hodge2016">A Workshop on the Proof of Rota's Conjecture</a> at Georgia (Atlanta, GA)
</li>
<li>(5-6 Mar) Speaking at AMS Special Session on ``<a href="http://www.ams.org/meetings/sectional/2237_program_ss1.html#title">Elliptic Curves</a>''  (Athens, GA)
</li>
<li>(11-16 Mar) <a href="http://swc.math.arizona.edu/">Arizona Winter School</a> on "Analytic Methods in Arithmetic Geometry" (Tucson, AZ)
</li>
<li>(Jan 29) Colloquium and seminar talk at the University of Tennessee (Knoxville, TN)
</li>
</ul>
</li>
<li>2015
<ul class="org-ul">
<li>(5-6 Dec) <a href="http://www.math.clemson.edu/~kevja/PANTS/PANTS25/">PANTS</a> XXV (Clemson, SC).
</li>
<li>(Nov 11-20) Visiting Eric Katz (Waterloo, CA)
</li>
<li>(Nov 10) Number Theory Seminar talk at the University of Oregon (Eugene, OR)
</li>
<li>(Nov 9) Colloquium at the University of Oregon (Eugene, OR)
</li>
<li>(23-25 Oct) <a href="https://sites.google.com/site/galgeoms2015/">Georgia Algebraic Geometry Symposium</a> @ Emory (Atlanta, GA) 
</li>
<li>(Sept 25) Speaking at the UW-Madison geometry seminar (Madison, WI).       
</li>
<li>(Sept 17) Speaking at the UW-Madison Number Theory seminar (Madison, WI).
</li>
<li>(Sept 12-13) <a href="http://www.mathcs.emory.edu/pantsxxiv/">PANTS</a> @ Emory (Atlanta, GA).
</li>
<li>(Sept) Visiting UW-Madison (Madison, WI).
</li>
<li>(Aug 17-21) <a href="http://aimath.org/workshops/upcoming/degenalggeom/">AIM workshop</a> on Degenerations in Algebraic  Geometry (Palo Alto, CA) 
</li>
<li>(12-31 July) <a href="http://www2.imperial.ac.uk/~rpwt/AMS.html">AMS Algebraic Geometry Summer Research Institute</a> (University of Utah)
</li>
<li>(June 8- July 17) <a href="http://mathcs.emory.edu/~ono/REUs/">Emory's REU</a> (Atlanta, GA)
</li>
<li>(26-30 May) Speaking at the <a href="https://sites.google.com/site/padicmethods2015/">Coleman Memorial Conference</a> at MSRI (Berkeley, CA)
</li>
<li>(17-22 May) Visiting Chris Hall at the IAS (Princeton, NJ)
</li>
<li>(7-13 May) Speaking at the University of Copenhagen (Copenhagen, Denmark)
</li>
<li>(30 Apr - 3 May) Speaking at the Cornell Number Theory Seminar (Ithaca, NY)
</li>
<li>(28 Apr) Speaking at the UIC Number Theory Seminar (Chicago, IL)
</li>
<li>(13 Apr) Speaking at the Stanford Number Theory Seminar (Palo Alto, CA)
</li>
<li>(9 Apr) Athens-Atlanta Joint Number Theory Seminar @UGA (Atlanta, GA)
</li>
<li>(2-4 Apr) Speaking at the Duke Number Theory Seminar (Durham, NC)
</li>
<li>(28-29 Mar) Speaking at <a href="http://www.ces.clemson.edu/~jimlb/SERMON/2015/SERMON_2015_participants.html">SERMON</a> at Winthrop University (Rock Hill, SC)
</li>
<li>(23 Mar) Math club talk at Georgia State (Atlanta, GA)
</li>
<li>(13-18 Mar) <a href="http://swc.math.arizona.edu/">Arizona Winter School</a> on Arithmetic and Higher-Dimensional Varieties (Tucson, AZ)
</li>
<li>(10 Mar) Colloquium at the University of Colorado-Boulder (Boulder, CO)
</li>
<li>(20 Feb) Colloquium at the University of Wisconsin-Madison (Madison, WI)       
</li>
</ul>
</li>
<li>2014
<ul class="org-ul">
<li>(6-7 Dec) <a href="http://www.math.sc.edu/~boylan/seminars/pantshome.html">PANTS</a> (Columbia, SC).
</li>
<li>(26-28 Nov) Thanksgiving break.
</li>
<li>(8-9 Nov) AMS Special Sessions on ``<a href="http://e-math.ams.org/meetings/sectional/2222_program_saturday.html">Automorphic forms and related topics</a>'' and <a href="http://e-math.ams.org/meetings/sectional/2222_program_ss20.html#title">"Connections in Number Theory</a>" (Greensboro, NC)
</li>
<li>(4 Nov) Athens-Atlanta Joint Number Theory Seminar @GaTech (Atlanta, GA)
</li>
<li>(25-26 Oct) AMS Special Session on ``<a href="http://www.ams.org/meetings/sectional/2214_program_ss9.html#title">Combinatorics and Algebraic Geometry</a>'' (San Francisco, CA)
</li>
<li>(18-19 Oct) <a href="http://gags.torsor.org/conf2014/">Georgia Algebraic Geometry Symposium</a> at UGA (Athens, GA) 
</li>
<li>(13-14 Oct) Fall break.
</li>
<li>(26 Sept) Speak at UVA  (Charlottesville, VA)
</li>
<li>(6-7 Sept) <a href="http://www.math.sc.edu/~boylan/seminars/pantshome.html">PANTS</a> (Orangeburg, SC).
</li>
<li>(9 June - 18 July) Emory's REU (Atlanta, GA)
</li>
<li>(12-16 May) <a href="http://www.aimath.org/ARCC/workshops/ratlhigherdimvar.html">AIM workshop</a> on Rational Points  (Palo Alto, CA) 
</li>
<li>(5-6 April) AMS special session on "<a href="http://www.ams.org/meetings/sectional/2215_program_ss17.html#title">Arithmetic and Differential Algebraic Geometry</a>" (Albuquerque, NM)
</li>
<li>(30 March - 4 April) BIRS Workshop on "<a href="http://www.birs.ca/events/2014/5-day-workshops/14w5133">Specialization of Linear Series for Algebraic and Tropical Curves</a>"  (Alberta, Canada)
</li>
<li>(21-23 March) AMS special session on "<a href="http://www.ams.org/meetings/sectional/2216_program_ss9.html#title">Arithmetic of Algebraic Curves</a>" (Knoxville, TN)
</li>
<li>(15-19 March) <a href="http://swc.math.arizona.edu/">Arizona Winter School</a> on Arithmetic Statistics (Tucson, Arizona)
</li>
<li>(28 Feb) Speak at USC  (Columbia, SC)
</li>
<li>(25 Feb) Athens-Atlanta Joint Number Theory Seminar @Emory (Atlanta, GA)
</li>
<li>(27-31 January) <a href="http://aimath.org/ARCC/workshops/arithstatffield.html">AIM workshop</a> on Arithmetic Statistics (Palo Alto, CA)
</li>
<li>(15-18 January) Joint Mathematics Meetings in Baltimore, Speaking at the special session on "<a href="http://jointmathematicsmeetings.org/meetings/national/jmm2014/2160_program_ss56.html">Tropical and Nonarchimedean Geometry</a>" (Baltimore, MD)
</li>
</ul>
</li>
<li>2013
<ul class="org-ul">
<li>(28-29 Nov) Thanksgiving break.
</li>
<li>(7-8 Dec) <a href="http://www.math.sc.edu/~boylan/seminars/pantshome.html">PANTS</a> (Clemson, SC).
</li>
<li>(8-10 Nov) <a href="http://www.math.sc.edu/~kustin/CA-AGMeeting.html">Commutative Algebra &#x2013; Algebraic Geometry in the Southeast</a> (USC, SC)
</li>
<li>(5 Nov) <a href="http://www.math.uga.edu/~lorenz/JointAthensAtlantaSeminar.html">Athens-Atlanta Joint Number Theory Seminar</a> at UGA (Athens, GA)
</li>
<li>(18-20 Oct) <a href="http://gags.torsor.org/conf2013/">Georgia Algebraic Geometry Symposium</a> at UGA (Athens, GA) 
</li>
<li>(14-15 Oct) Fall Break.
</li>
<li>(9-16 Oct) Speaking at the Copenhagen Number Theory Seminar (Copenhagen, Denmark)
</li>
<li>(11 Sep) Speaking at the Clemson Number Theory Seminar  (Clemson, SC).
</li>
<li>(7-8 Sep) <a href="http://www.math.sc.edu/~boylan/seminars/pantshome.html">PANTS</a> (Davidson, NC).
</li>
<li>(1-4 August) <a href="http://wiki.siam.org/siag-ag/index.php/SIAM_Conference_on_Applied_Algebraic_Geometry_2013">SIAM Conference on Applied Algebraic Geometry</a> at Colorado State University (Fort Collins, CO).
</li>
<li>(3 June - 26 July) REU (Atlanta, GA)
</li>
<li>(20-24 May) Colloquium at Wake Forest University (Winston-Salem, NC )
</li>
<li>(3-5 May) <a href="http://homepages.math.uic.edu/~rtakloo/atkin2013.html">Atkin Memorial Lectures and workshop on the Cohen-Lenstra conjectures</a> at University of Chicago (Chicago, IL)
</li>
<li>(22-27 April) Colloquium and Number Theory Seminar at the University of
Arizona (Tucson, AZ)
</li>
<li>(16 April) Athens-Atlanta Joint Number Theory Seminar (Atlanta, GA)
</li>
<li>(13-14 April) AMS special session on "Arithmetic statistics
and big monodromy" (Denver, CO).
</li>
<li>(9-13 March) <a href="http://swc.math.arizona.edu/aws/2013/index.html">Arizona Winter School</a> on Modular forms and Modular curves (Tucson, Arizona)
</li>
<li>(Jan 30-Feb 2) <a href="http://scienceonline.com/">Scienceonline 2013</a>, speaking about MathOverflow (Raleigh, NC)
</li>
<li>(Jan 9-12) Joint Mathematics Meetings;
Speaking at the special sessions on "Witt Vectors" and "Geometry and Number Theory" (San Diego, CA)
</li>
</ul>
</li>
<li>2012
<ul class="org-ul">
<li>(1-2 Dec) PANTS XIX (USC, SC).
</li>
<li>(8-18 Nov) <a href="http://rational.epfl.ch/workshop2.php">Workshop: Arithmetic of abelian varieties in families</a>, EPFL, (Lausanne, Switzerland)
</li>
<li>(17 Sep) Speaking at Ga Tech @ 3p (Atlanta, GA)
</li>
<li>(15-16 Sep) Speaking at <a href="http://www.wfu.edu/~rouseja/pantsxviii/">PANTS XVIII</a> (Wake Forest, NC).
</li>
<li>(21 Aug) Speaking at the Colorado State Number Theory Seminar (Ft. Collins, Colorado)
</li>
<li>(11 June &#x2013; 27 July) REU (Emory University, GA) 
</li>
<li>(May) Visiting Bruno Chiarellotto (Padova, Italy)
</li>
<li>(10 Apr) Athens-Atlanta Joint Number Theory Seminar (Athens, GA)
</li>
<li>(4-9 Apr) Speaking at the UC Irvine Number Theory Seminar on 4/5 (Irvine, CA)
</li>
<li>(20 March) Visitor @ Emory: Anton Geraschenko
</li>
<li>(10-13 Mar) Arizona Winter School (Tucson, AZ)
</li>
<li>(2-9 Mar) AMS Sectional + Algebraic Number Theory, Arithmetic Geometry, and Modular Forms (Hawaii)
</li>
<li>(9 Feb) Speaking at the New York Joint Number Theory Seminar (CUNY)
</li>
<li>(25 Jan) Speaking at the Number Theory Seminar (UGA)
</li>
<li>(02 Feb) Visitor @ Emory: Jeremy Rouse
</li>
<li>(20 Jan) Visitor @ Emory: Frank Thorne
</li>
<li>(4-7 January) Joint Mathematics Meetings in Boston
Speaking at the special session on "Rational Points on Varieties" and "Arithmetic Geometry".
</li>
</ul>
</li>
<li>2011
<ul class="org-ul">
<li>(3-4 Dec) PANTS XVII (Clemson, SC).
</li>
<li>(29 Nov - 1 Dec) Speaking at the Harvard Number Theory seminar on Wednesday.
</li>
<li>(10-16 November) Visiting Caltech, speaking at the Algebraic Geometry seminar on Monday.
</li>
<li>(2 November) Speaking at the Athens-Atlanta Joint Number Theory Seminar (Georgia Tech).
</li>
<li>(13 Oct) Speaking at the Emory Algebra and Number Theory Seminar.
</li>
<li>(10-11 Oct) Speaking at the University of South Carolina Number Theory Seminar on Tuesday.
</li>
<li>(23-25 September) AMS special session on Modular Forms and Elliptic Curves (Wake Forest Univeristy, NC).
</li>
<li>(10-11 September) Attending PANTS (Emory).
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Zureick-Brown</p>
<p class="date">Created: 2023-08-19 Sat 11:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>